app/views/users/assign_role.html.haml

SELECT "roles"."name" FROM "roles"
---
          Select Role
          = f.select :roles, options_for_select(Role.pluck(:name)), {}, { multiple: true, id: 'dropDown'}