app/views/projects/_form.html.haml

      %span
        = select_tag "project[users][]", options_from_collection_for_select(User.developers, :id, :first_name, @project.users.pluck(:id)), id: 'dropDown', multiple: true
---
SELECT "users"."id", "users"."first_name" FROM "users" LEFT OUTER JOIN "user_roles" ON "user_roles"."user_id" = "users"."id" LEFT OUTER JOIN "roles" ON "roles"."id" = "user_roles"."role_id" WHERE "roles"."name" = $1  [["name", "developer"]]