app/views/projects/_todo_fields.html.haml

    = f.label :status
    = f.select :status, options_for_select(TODO_STATUS, f.object&.status || 'ToDo')
  .field
    = f.label :user
    = f.select :user_id, options_for_select(User.developers.pluck(:first_name, :id), f.object&.user&.id)
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 5]]
SELECT "users"."id", "users"."first_name" FROM "users" LEFT OUTER JOIN "user_roles" ON "user_roles"."user_id" = "users"."id" LEFT OUTER JOIN "roles" ON "roles"."id" = "user_roles"."role_id" WHERE "roles"."name" = $1  [["name", "developer"]]