app/views/projects/_user_fields.html.haml

SELECT "users".* FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = $1  [["project_id", 5]]
---
  .field
    = f.select :user_id, options_for_select(User.developers, f.object.user.id)