app/controllers/home_controller.rb

  def index
    @all_projects = Project.page(params[:page]).per(10)
    @all_todos = current_user.todos.page(params[:page]).per(10)
---
SELECT  "projects".* FROM "projects" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT  "todos".* FROM "todos" WHERE "todos"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 4], ["LIMIT", 10], ["OFFSET", 0]]