app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Project One"], ["created_at", "2018-06-16 09:19:14.527972"], ["updated_at", "2018-06-16 09:19:14.527972"]]