app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "users"

  def assign_role
    return unless params[:user].present?
---
SELECT  "users".* FROM "users" WHERE (22) LIMIT $1  [["LIMIT", 1]]

  def find_user
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]